package java_20200511;

public class HelloWorld {
	public static void main(String[] args) {
		System.out.println("Hello World");	
	
		
	}
}

// int a = 100; //
// 자료형 변수 = 값(value); 변수 및 상수에 저장되는 값!
// data type: 자바에서는 9가지가 있다! 
// 자료형 뒤에 오는 식별자를 '변수'라고 함 : 식별자의 작성규칙을 암기해야 함 , 뒤에 오는 값을   Value라고 하고 literal이라고 총칭함
// 식별자(identifier): 클래스명, 메서드명, 변수명, 패키지명

// 1) 첫글자는 문자로, 특수문자(_,$ 제외)사용불가, 숫자 사용불가 
// 2) 대소문자 구분
// 3) 특수문자와 공백문자를 사용할 수 없으나 위의 두가지(_, $) 사용가능
// 4) 예약어는 식별자로 사용할 수 없음 
// 5) *클래스이름 작성시 첫 글자는 대문자로 나머지는 모두 소문자로 시작함 
// 6) *두 단어를 합성할 떄 두 번째 첫 글자는 대문자로 함 
// 7) *상수는 모두 대문자로 함

