package java_20200520;

public class Memo {
	public static void main(String[] args) {
		// reference 타입의 형변환을 하는 이유는??
		// 결론적으로:
		// 형변환을 하는 이유는 추상클래스와 관련이 크다.
		// 객체형변환은 일반클래스일 때는 객체의 형변환을 하지 않는다.
		// 상위슈퍼클래스가 추상클래스이거나 인터페이스일경우에 실행한다.
		// 추상클래스는 객체를 생성할 수 없다
		// 추상클래스는 어떻게 객체를 생성해서 메모리에 저장할까? => 서브클래스의 도움을 받아야 한다
		
		
		
		
		//수의체계를 찾기
		/*10^1 = 데카
		 *10^2 = 헥토
		 *10^3 = 킬로
		 *10^6 = 메가
		 *10^9 = 기가
		 *10^12 = 테라
		 *
		 *0.1^1 = 데시
		 *0.1^2 = 센티
		 *0.1^3 = 밀리
		 *0.1^6 = 마이크로
		 *0.1^9 = 나노
		 *0.1^12 = 피코
		 *
		 */
		
		
		
		
	}

}
